## Introducing DataFrames

In [1]:
import pandas as pd

In [2]:
dogs = pd.read_csv('dogs.csv')

In [3]:
print(dogs)

      name        breed   color  height_cm  weight_kg date_of_birth
0    Bella     Labrador   Brown         56         25    2013-07-01
1  Charlie       Poodle   Black         43         23    2016-09-16
2     Lucy    Chow Chow   Brown         46         22    2014-08-25
3   Cooper    Schnauzer    Gray         49         17    2011-12-11
4      Max     Labrador   Black         59         29    2017-01-20
5   Stella    Chihuahua     Tan         18          2    2015-04-20
6   Bernie  St. Bernard   White         77         74    2018-02-27

In [4]:
dogs.head()

      name      breed   color  height_cm  weight_kg date_of_birth
0    Bella   Labrador   Brown         56         25    2013-07-01
1  Charlie     Poodle   Black         43         23    2016-09-16
2     Lucy  Chow Chow   Brown         46         22    2014-08-25
3   Cooper  Schnauzer    Gray         49         17    2011-12-11
4      Max   Labrador   Black         59         29    2017-01-20

In [5]:
dogs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 6 columns):
name             7 non-null object
breed            7 non-null object
color            7 non-null object
height_cm        7 non-null int64
weight_kg        7 non-null int64
date_of_birth    7 non-null object
dtypes: int64(2), object(4)
memory usage: 416.0+ bytes

In [6]:
dogs.describe()

       height_cm  weight_kg
count   7.000000   7.000000
mean   49.714286  27.428571
std    17.960274  22.292429
min    18.000000   2.000000
25%    44.500000  19.500000
50%    49.000000  23.000000
75%    57.500000  27.000000
max    77.000000  74.000000

In [7]:
dogs.values

array([['Bella', 'Labrador', 'Brown', 56, 25, '2013-07-01'],
       ['Charlie', 'Poodle', 'Black', 43, 23, '2016-09-16'],
       ['Lucy', 'Chow Chow', 'Brown', 46, 22, '2014-08-25'],
       ['Cooper', 'Schnauzer', 'Gray', 49, 17, '2011-12-11'],
       ['Max', 'Labrador', ' Black', 59, 29, '2017-01-20'],
       ['Stella', 'Chihuahua', 'Tan', 18, 2, '2015-04-20'],
       ['Bernie', 'St. Bernard', 'White', 77, 74, '2018-02-27']],
      dtype=object)

In [8]:
dogs.columns

Index(['name', 'breed', 'color', 'height_cm', 'weight_kg', 'date_of_birth'], dtype='object')

In [9]:
dogs.index

RangeIndex(start=0, stop=7, step=1)

## Sorting and Subsetting

### Sorting

In [10]:
dogs.sort_values("weight_kg")

      name        breed   color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua     Tan         18          2    2015-04-20
3   Cooper    Schnauzer    Gray         49         17    2011-12-11
2     Lucy    Chow Chow   Brown         46         22    2014-08-25
1  Charlie       Poodle   Black         43         23    2016-09-16
0    Bella     Labrador   Brown         56         25    2013-07-01
4      Max     Labrador   Black         59         29    2017-01-20
6   Bernie  St. Bernard   White         77         74    2018-02-27

### Sorting in descending order

In [11]:
dogs.sort_values("weight_kg", ascending=False)

      name        breed   color  height_cm  weight_kg date_of_birth
6   Bernie  St. Bernard   White         77         74    2018-02-27
4      Max     Labrador   Black         59         29    2017-01-20
0    Bella     Labrador   Brown         56         25    2013-07-01
1  Charlie       Poodle   Black         43         23    2016-09-16
2     Lucy    Chow Chow   Brown         46         22    2014-08-25
3   Cooper    Schnauzer    Gray         49         17    2011-12-11
5   Stella    Chihuahua     Tan         18          2    2015-04-20

## Sorting by multiple variables

In [12]:
dogs.sort_values(["weight_kg", "height_cm"])

      name        breed   color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua     Tan         18          2    2015-04-20
3   Cooper    Schnauzer    Gray         49         17    2011-12-11
2     Lucy    Chow Chow   Brown         46         22    2014-08-25
1  Charlie       Poodle   Black         43         23    2016-09-16
0    Bella     Labrador   Brown         56         25    2013-07-01
4      Max     Labrador   Black         59         29    2017-01-20
6   Bernie  St. Bernard   White         77         74    2018-02-27

## Sorting by multiple variables

In [13]:
dogs.sort_values(["weight_kg", "height_cm"], ascending=[True, False])

      name        breed   color  height_cm  weight_kg date_of_birth
5   Stella    Chihuahua     Tan         18          2    2015-04-20
3   Cooper    Schnauzer    Gray         49         17    2011-12-11
2     Lucy    Chow Chow   Brown         46         22    2014-08-25
1  Charlie       Poodle   Black         43         23    2016-09-16
0    Bella     Labrador   Brown         56         25    2013-07-01
4      Max     Labrador   Black         59         29    2017-01-20
6   Bernie  St. Bernard   White         77         74    2018-02-27

## Subsetting columns

In [14]:
dogs["name"]

0      Bella
1    Charlie
2       Lucy
3     Cooper
4        Max
5     Stella
6     Bernie
Name: name, dtype: object

## Subsetting multiple columns

In [15]:
dogs[["breed", "height_cm"]]

         breed  height_cm
0     Labrador         56
1       Poodle         43
2    Chow Chow         46
3    Schnauzer         49
4     Labrador         59
5    Chihuahua         18
6  St. Bernard         77

In [16]:
cols_to_subset = ["breed", "height_cm"]
dogs[cols_to_subset]

         breed  height_cm
0     Labrador         56
1       Poodle         43
2    Chow Chow         46
3    Schnauzer         49
4     Labrador         59
5    Chihuahua         18
6  St. Bernard         77

## Subsetting rows

In [17]:
dogs["height_cm"] > 50

0     True
1    False
2    False
3    False
4     True
5    False
6     True
Name: height_cm, dtype: bool

In [18]:
dogs[dogs["height_cm"] > 50]

     name        breed   color  height_cm  weight_kg date_of_birth
0   Bella     Labrador   Brown         56         25    2013-07-01
4     Max     Labrador   Black         59         29    2017-01-20
6  Bernie  St. Bernard   White         77         74    2018-02-27

## Subsetting based on text data

In [19]:
dogs[dogs["breed"] == "Labrador"]

    name     breed   color  height_cm  weight_kg date_of_birth
0  Bella  Labrador   Brown         56         25    2013-07-01
4    Max  Labrador   Black         59         29    2017-01-20

## Subsetting based on dates

In [20]:
dogs[dogs["date_of_birth"] > "2015-01-01"]

      name        breed   color  height_cm  weight_kg date_of_birth
1  Charlie       Poodle   Black         43         23    2016-09-16
4      Max     Labrador   Black         59         29    2017-01-20
5   Stella    Chihuahua     Tan         18          2    2015-04-20
6   Bernie  St. Bernard   White         77         74    2018-02-27

## Subsetting based on multiple conditions

In [21]:
is_lab = dogs["breed"] == "Labrador"
is_brown = dogs["color"] == "Brown"
dogs[is_lab & is_brown]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         25    2013-07-01

In [22]:
dogs[ (dogs["breed"] == "Labrador") & (dogs["color"] == "Brown") ]

    name     breed  color  height_cm  weight_kg date_of_birth
0  Bella  Labrador  Brown         56         25    2013-07-01

## Subsetting using .isin()

In [23]:
is_black_or_brown = dogs["color"].isin(["Black", "Brown"])
dogs[is_black_or_brown]

      name      breed  color  height_cm  weight_kg date_of_birth
0    Bella   Labrador  Brown         56         25    2013-07-01
1  Charlie     Poodle  Black         43         23    2016-09-16
2     Lucy  Chow Chow  Brown         46         22    2014-08-25

## Adding a new column

In [24]:
dogs["height_m"] = dogs["height_cm"] / 100
print(dogs)

      name        breed   color  height_cm  weight_kg date_of_birth  height_m
0    Bella     Labrador   Brown         56         25    2013-07-01      0.56
1  Charlie       Poodle   Black         43         23    2016-09-16      0.43
2     Lucy    Chow Chow   Brown         46         22    2014-08-25      0.46
3   Cooper    Schnauzer    Gray         49         17    2011-12-11      0.49
4      Max     Labrador   Black         59         29    2017-01-20      0.59
5   Stella    Chihuahua     Tan         18          2    2015-04-20      0.18
6   Bernie  St. Bernard   White         77         74    2018-02-27      0.77

## Doggy mass index

In [25]:
dogs["bmi"] = dogs["weight_kg"] / dogs["height_m"] ** 2
print(dogs.head())

      name      breed   color  height_cm  weight_kg date_of_birth  height_m  \
0    Bella   Labrador   Brown         56         25    2013-07-01      0.56
1  Charlie     Poodle   Black         43         23    2016-09-16      0.43
2     Lucy  Chow Chow   Brown         46         22    2014-08-25      0.46
3   Cooper  Schnauzer    Gray         49         17    2011-12-11      0.49
4      Max   Labrador   Black         59         29    2017-01-20      0.59

          bmi
0   79.719388
1  124.391563
2  103.969754
3   70.803832
4   83.309394

## Multiple manipulations

In [26]:
bmi_lt_100 = dogs[dogs["bmi"] < 100]
bmi_lt_100_height = bmi_lt_100.sort_values("height_cm", ascending=False)
bmi_lt_100_height[["name", "height_cm", "bmi"]]

     name  height_cm        bmi
4     Max         59  83.309394
0   Bella         56  79.719388
3  Cooper         49  70.803832
5  Stella         18  61.728395